package view;

import java.util.Scanner;

import controller.Controller;
import model.QuestionDAO;
import model.QuestionDTO;
import model.TierDTO;
import model.User_infoDTO;

public class view_main {

	public static void main(String[] args) {
		Scanner sc = new Scanner(System.in);
		Controller cot = new Controller();

		{
			System.out.println("\r\n"
					+ "███╗   ██╗ ██████╗ ███╗   ██╗███████╗███████╗███╗   ██╗███████╗███████╗     ██████╗ ██╗   ██╗██╗███████╗     ██████╗  █████╗ ███╗   ███╗███████╗\r\n"
					+ "████╗  ██║██╔═══██╗████╗  ██║██╔════╝██╔════╝████╗  ██║██╔════╝██╔════╝    ██╔═══██╗██║   ██║██║╚══███╔╝    ██╔════╝ ██╔══██╗████╗ ████║██╔════╝\r\n"
					+ "██╔██╗ ██║██║   ██║██╔██╗ ██║███████╗█████╗  ██╔██╗ ██║███████╗█████╗      ██║   ██║██║   ██║██║  ███╔╝     ██║  ███╗███████║██╔████╔██║█████╗  \r\n"
					+ "██║╚██╗██║██║   ██║██║╚██╗██║╚════██║██╔══╝  ██║╚██╗██║╚════██║██╔══╝      ██║▄▄ ██║██║   ██║██║ ███╔╝      ██║   ██║██╔══██║██║╚██╔╝██║██╔══╝  \r\n"
					+ "██║ ╚████║╚██████╔╝██║ ╚████║███████║███████╗██║ ╚████║███████║███████╗    ╚██████╔╝╚██████╔╝██║███████╗    ╚██████╔╝██║  ██║██║ ╚═╝ ██║███████╗\r\n"
					+ "╚═╝  ╚═══╝ ╚═════╝ ╚═╝  ╚═══╝╚══════╝╚══════╝╚═╝  ╚═══╝╚══════╝╚══════╝     ╚══▀▀═╝  ╚═════╝ ╚═╝╚══════╝     ╚═════╝ ╚═╝  ╚═╝╚═╝     ╚═╝╚══════╝\r\n"
					+ "                                                                                                                                                \r\n"
					+ "  ");
             
			
			
			
			
			while (true) {
             System.out.println("|￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣|\r\n"
             		+ "|　넌센스 퀴즈 게임!　　　　　　　　　　　　　 　　[－][口][×] |\r\n"
             		+ "|￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣|\r\n"
             		+ "|　넌센스 퀴즈에 오신걸 환영합니다 　　                  |\r\n"
             		+ "|　        　　　　　　　　　　　　　　　　　　　　　　　　     |\r\n"
             		+ "|　　＿＿＿＿＿＿＿＿　　　　＿＿＿＿＿＿＿＿　　　　＿＿＿＿＿＿＿　　|\r\n"
             		+ "| 　|[1] 로그인　|　　　｜[2]회원가입｜ 　  |[5]게임종료|　|\r\n"
             		+ "|　　￣￣￣￣￣￣￣￣　　　　￣￣￣￣￣￣￣￣　　　　￣￣￣￣￣￣￣　　|\r\n"
             		+ "￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣\r\n"
             		+ "");
				
				
			

				int choice = sc.nextInt();
				if (choice == 5) {
					System.out.println("게임을 종료합니다.");
					break;
				} else if (choice == 1) { // 로그인
					cot.login();

					while (true) {
					    System.out.println("|￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣|\r\n"
			             		+ "|　넌센스 퀴즈 게임!　　　　　　　　　　　　　                   　　[－][口][×] |\r\n"
			             		+ "|￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣|\r\n"
			             		+ "|　넌센스 퀴즈에 오신걸 환영합니다 　　                                   |\r\n"
			             		+ "|　        　　　　　　　　　　　　　　　　　　　　　　　　                      |\r\n"
			             		+ "|　　＿＿＿＿＿＿＿＿　　　　＿＿＿＿＿＿＿＿　　　　＿＿＿＿＿＿＿＿　    ＿＿＿＿＿＿＿＿   |\r\n"
			             		+ "| 　|[3]게임시작|　　 　｜[4]티어조회｜ 　  |[5]회원탈퇴 |    |[6]게임종료 |  |\r\n"
			             		+ "|　　￣￣￣￣￣￣￣￣　　　　￣￣￣￣￣￣￣￣　　　　￣￣￣￣￣￣￣￣　　   ￣￣￣￣￣￣￣￣   |\r\n"
			             		+ "￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣\r\n"
			             		+ "");
				
						int controller = sc.nextInt();
						if (controller == 3) { // 게임 캐릭터 선택 or 게임시작
							// 문제 풀고 정답까지 비교 하는 메소드 호출 해줌.
							cot.solution();


						} else if (controller == 4) {// 랭킹 조회              

							cot.showTier();
						}else if(controller == 5) {//---------------------------------------------------회원탈퇴
							cot.deleteId();
						}
						else if (controller == 6) {// 랭킹 조회
							System.out.println("게임을 완전히 종료 합니다.");
							return;
						}
					}

				} else if (choice == 2) { // 회원가입
							cot.joinId();
					
				}

			}
		}
	}

}